#!/usr/bin/python3

from bibref.tools import *

names = [ "Φαρες", "Ζαρα", "Εσρωμ", "Αραμ", "Αμιναδαβ", "Ναασσων",
    "Σαλμων", "Βοες", "Ραχαβ", "Ιωβηδ", "Ρουθ", "Ιεσσαι", "Δαυιδ",
    "Σολομων", "Ροβοαμ", "Αβια", "Ασαφ", "Ιωσαφατ", "Ιωραμ", "Οζιας",
    "Ιωαθαμ", "Αχαζ", "Εζεκιας", "Μανασση", "Αμως", "Ιωσιας",
    "Ιεχονιας", "Σαλαθιηλ", "Ζοροβαβελ", "Αβιουδ", "Ελιακειμ", "Αζωρ",
    "Σαδωκ", "Αχειμ", "Ελιουδ", "Ελεαζαρ", "Ματθαν", "Ιακωβ", "Ιωσηφ" ]

maxresults(10000)

for name in names:
    text1(name)
    occurrences = find1("LXX")
    print(name, len(occurrences))
